/*******************************************************************************
* Leonardo Mudrek de Almeida
* UTFPR - CT
*
*
* License : CC BY NC SA 4.0
*******************************************************************************/
#ifndef WIFI_APP_H
#define WIFI_APP_H

/*******************************************************************************
* INCLUDES
*******************************************************************************/
#include "esp_bit_defs.h"
/*******************************************************************************
* DEFINES E ENUMS
*******************************************************************************/
/* Tipos de sinais utilização na task de configuração */
typedef enum wifiAppSignal_t
{
  WIFI_APP_CONNECTED_SIGNAL = BIT0,
  WIFI_APP_DISCONNECTED_SIGNAL = BIT1,
  WIFI_APP_CONNECT_SIGNAL = BIT2,
  WIFI_APP_RECONNECT_SIGNAL = BIT3,
  WIFI_APP_RESTART_CONFIG_SIGNAL = BIT4,
  WIFI_APP_STA_DEFAULT_SIGNAL = BIT5,
  WIFI_APP_NULL = 0x00,
} wifiAppSignal_t;

/*******************************************************************************
* TYPEDEFS
*******************************************************************************/

/*******************************************************************************
* FUNÇÕES EXPORTADAS
*******************************************************************************/
void wifi_app_connect(void);
void wifi_app_set(wifiAppSignal_t signal);
/*******************************************************************************
* END OF FILE
*******************************************************************************/
#endif
